2D_Plane_EE_Multiphase/0_org/Theta.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Theta.particles;
}
// ************************************************************************* //

dimensions          [0 2 -2 0 0 0 0];

internalField       uniform 0;

referenceLevel      1e-4;

boundaryField
{
    inlet
    {
        type               fixedValue;
        value              uniform 1e-4;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.0e-4;
        value           uniform 1.0e-4;
    }

    land
    {
        type            JohnsonJacksonParticleTheta;
        restitutionCoefficient 0.2;
        specularityCoefficient   0.1;
        muF             0.25;
        sigma           2;
        value           uniform 1e-4;
    }
    
    plane
    {
        type            JohnsonJacksonParticleTheta;
        restitutionCoefficient 0.2;
        specularityCoefficient   0.1;
        muF             0.25;
        sigma           2;
        value           uniform 1e-4;
    }
    
    top
    {
        type               slip;
    }

    frontAndBack
    {
        type               empty;
    }
}

// ************************************************************************* //
